{
  "backend/main.mo": "Implements change request submission and admin review with access control using a map-based store and authorization mixin.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to their related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend files describing their roles in the UI and data structure.",
  "frontend/index.css": "Defines global Tailwind layers and OKLCH theme variables for light and dark modes, applying background and text styles.",
  "frontend/index.html": "HTML entry bootstrapping theme from localStorage before React loads and mounting the app root.",
  "frontend/src/App.tsx": "Composes the full single-page layout by rendering all major site sections and global components.",
  "frontend/src/components/aqi/AQIGuide.tsx": "Renders an interactive AQI category guide with tabs, alerts, and category-specific health information.",
  "frontend/src/components/diseases/ConditionCard.tsx": "Displays a health condition card with symptoms and protective steps using shared UI components.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with quick links, branding, smooth-scroll navigation, and dynamic UTM tracking.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with desktop and mobile navigation, smooth-scrolling links, and a theme toggle.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button that switches between light and dark themes using icons and a custom theme hook.",
  "frontend/src/components/layout/TopRightCreditLabel.tsx": "Fixed corner label displaying site creator credit.",
  "frontend/src/components/reviews/StarRating.tsx": "Displays a star-based rating with filled and unfilled icons and a text summary.",
  "frontend/src/components/sections/AQICategoriesSection.tsx": "Section introducing AQI categories with description text and an embedded AQI guide component.",
  "frontend/src/components/sections/AQIForecastSection.tsx": "Interactive AQI forecast section with state and district selectors and dynamically loaded forecast data.",
  "frontend/src/components/sections/DiseasesConditionsSection.tsx": "Section describing health impacts of air pollution with a disclaimer and condition cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with title, description, call-to-action buttons, and a background image.",
  "frontend/src/components/sections/IndoorAirActionPlanSection.tsx": "Indoor air quality action plan section outlining key areas and practical steps to reduce indoor pollution.",
  "frontend/src/components/sections/LongTermHealthSection.tsx": "Explains long-term health effects of air pollution with detailed impact cards and protective strategies.",
  "frontend/src/components/sections/PreventionTipsSection.tsx": "Displays a prevention tips section with multiple cards listing actionable indoor, outdoor, and mask-related air quality tips.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Renders a projects showcase with filterable bike and car silencer projects, including descriptions, impacts, and images.",
  "frontend/src/components/sections/RequestChangeSection.tsx": "Provides a form for authenticated users to submit change requests with optional section selection and contact info.",
  "frontend/src/components/sections/ReviewBoxSection.tsx": "Shows a review box card containing a title, description, and a static five‑star rating component.",
  "frontend/src/components/sections/SymptomsHelpSection.tsx": "Presents emergency warning signs and common pollution‑related symptoms using alerts and informational cards.",
  "frontend/src/components/sections/VideosSection.tsx": "Displays deduplicated Hindi and English educational videos using responsive embedded video cards.",
  "frontend/src/components/sections/VulnerableGroupsSection.tsx": "React section displaying vulnerable groups with alerts, icons, descriptions, and protective guidance lists.",
  "frontend/src/components/sections/WhatIsAQISection.tsx": "React section explaining AQI, what it measures, why it matters, pollution sources, and the AQI scale.",
  "frontend/src/content/aqiCategories.ts": "Exports AQI category definitions with ranges, colors, descriptions, health risks, and recommended actions.",
  "frontend/src/content/conditions.ts": "Defines health conditions affected by pollution with symptoms, risks, and protective steps.",
  "frontend/src/content/indiaStatesDistricts.ts": "Dataset listing Indian states and union territories with their districts.",
  "frontend/src/content/stateAqiForecast.ts": "Contains AQI data and forecasts for Indian states plus helpers for computing categories and generating fallback data.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the current identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, storing and exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future backend-related React Query hooks; currently empty.",
  "frontend/src/hooks/useSubmitChangeRequest.ts": "Provides a mutation to submit change requests through the backend actor and invalidate cached queries.",
  "frontend/src/hooks/useTheme.ts": "Handles light/dark theme state with localStorage persistence and class-based application.",
  "frontend/src/index.css": "Defines Tailwind base styles and color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, and layout settings.",
  "project_state.json": "Project metadata tracking features, requirements, and current state."
}