{
  "backend/main.mo": "Manages change requests with access‑controlled submission, admin review, and storage in a Map with auto‑incrementing IDs.",
  "feature_evidence.json": "Lists implemented features, related files, components, tests, and confidence levels for project feature tracking.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files and their roles in the UI and application structure.",
  "frontend/index.css": "Defines global Tailwind layers and extensive OKLCH-based design tokens for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads the React app with updated title and meta description.",
  "frontend/src/App.tsx": "Main app component assembling the header, footer, and all site sections including two new added sections.",
  "frontend/src/components/aqi/AQIGuide.tsx": "Interactive AQI guide using tabs to display category details, risks, and recommended actions with an educational alert.",
  "frontend/src/components/diseases/ConditionCard.tsx": "Reusable card component rendering a health condition’s icon, description, symptoms, and protective steps.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer displaying site branding, quick scroll-to-section links, and an educational disclaimer. Implements smooth scrolling for anchor navigation.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header with desktop and mobile navigation supporting smooth scrolling to page sections. Includes responsive menu toggling via a sheet drawer.",
  "frontend/src/components/layout/TopRightCreditLabel.tsx": "Fixed bottom-left label displaying site credit text. Non-interactive and styled for visibility.",
  "frontend/src/components/sections/AQICategoriesSection.tsx": "Section introducing AQI categories with descriptive text. Renders an AQIGuide component for detailed category information.",
  "frontend/src/components/sections/DiseasesConditionsSection.tsx": "Section explaining health impacts of air pollution with a medical disclaimer. Displays a grid of condition cards sourced from content data.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with title, description, action buttons, and a featured image. Buttons scroll to key AQI sections smoothly.",
  "frontend/src/components/sections/IndoorAirActionPlanSection.tsx": "Section presenting indoor air quality action areas with icons, descriptions, and actionable steps. Includes quick-win tips and an educational alert.",
  "frontend/src/components/sections/LongTermHealthSection.tsx": "Section outlining long-term health effects of air pollution using cards and lists. Includes a medical disclaimer and protective strategy guidance.",
  "frontend/src/components/sections/PreventionTipsSection.tsx": "Section offering categorized prevention tips for indoor, outdoor, and mask-related air quality protection. Uses card-based layout with bullet lists.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Renders a projects showcase with filter controls, displaying bike and car silencer projects with descriptions and images. Uses state to filter items by category.",
  "frontend/src/components/sections/RequestChangeSection.tsx": "Provides a form for authenticated users to submit change requests with optional section and contact info. Handles login flow, validation, and success feedback.",
  "frontend/src/components/sections/SymptomsHelpSection.tsx": "Displays guidance on recognizing pollution-related symptoms and when to seek emergency or routine medical help. Includes alerts and symptom lists.",
  "frontend/src/components/sections/VulnerableGroupsSection.tsx": "Explains pollution risks for vulnerable populations and offers protective guidance for groups like children and older adults. Uses cards and alerts for structured info.",
  "frontend/src/components/sections/WhatIsAQISection.tsx": "Introduces the AQI, explaining what it measures, why it matters, pollution sources, and how to interpret the scale. Uses cards to organize key concepts.",
  "frontend/src/content/aqiCategories.ts": "Exports structured AQI category data including ranges, colors, descriptions, health risks, and recommended actions. Used for rendering AQI-related UI.",
  "frontend/src/content/conditions.ts": "Defines a HealthCondition interface and a list of detailed health conditions related to air pollution.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to the user's identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and provider for managing Internet Identity login, storage, and status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting no backend query hooks exist yet.",
  "frontend/src/hooks/useSubmitChangeRequest.ts": "Provides a mutation hook to submit change requests via the backend actor and refresh related queries.",
  "frontend/src/index.css": "Defines global Tailwind CSS styles, theme variables, and typography rules for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, plugins, and content scanning rules.",
  "project_state.json": "Tracks project version, requested website updates, existing features, and new feature requests. Includes architectural notes and configuration for handling content changes without auto-deployment."
}