{
  "backend/main.mo": "Main backend actor implementing change request submission and review system with role-based access control (users can submit, admins can view and review).",
  "feature_evidence.json": "Feature evidence report documenting the creator credit label feature with high confidence, listing relevant files and components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, sections, styles, and hooks for the AirHealth air quality education site.",
  "frontend/index.css": "Tailwind CSS base layer defining custom CSS variables for light and dark themes using OKLCH color space with deep forest green primary and warm amber accents.",
  "frontend/index.html": "HTML entry point with SEO metadata, canonical URL, Open Graph tags, and theme bootstrap script to prevent flash of unstyled content.",
  "frontend/public/.well-known/ic-domains": "IC domains configuration file specifying the custom domain saharshuniyal-airhealth.com.",
  "frontend/public/CNAME": "CNAME file for GitHub Pages custom domain configuration pointing to saharshuniyal-airhealth.com.",
  "frontend/src/App.tsx": "Root application component managing robot verification gate and rendering all site sections with persistent CreatorCredit component visible across all states.",
  "frontend/src/components/aqi/AQIGuide.tsx": "Interactive tabbed component displaying AQI categories with color-coded tabs, health risk information, and recommended actions for each level.",
  "frontend/src/components/diseases/ConditionCard.tsx": "Reusable card component displaying health condition details including icon, pollution link, symptoms list, and protective steps.",
  "frontend/src/components/layout/CreatorCredit.tsx": "Fixed bottom-left corner component displaying 'made by Saharsh UNIYAL' with semi-transparent background and backdrop blur.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer component with site branding, quick navigation links with smooth scroll, medical disclaimer, contact info, and student details block.",
  "frontend/src/components/layout/SiteHeader.tsx": "Sticky header component with logo, desktop/mobile navigation menus, and theme toggle. Handles smooth scrolling to page sections via anchor links.",
  "frontend/src/components/layout/ThemeToggle.tsx": "Button component that toggles between light and dark themes using the useTheme hook. Displays sun/moon icons with smooth transitions.",
  "frontend/src/components/layout/TopRightCreditLabel.tsx": "Empty file with no content.",
  "frontend/src/components/reviews/StarRating.tsx": "Displays a star rating visualization with filled/unfilled stars and text label showing the rating out of a maximum value (default 5).",
  "frontend/src/components/robot-verification/RobotVerificationGate.tsx": "Full-screen modal dialog with checkbox verification to confirm user is human before accessing the site. Includes error handling and retry functionality.",
  "frontend/src/components/sections/AQICategoriesSection.tsx": "Section component that displays AQI categories and their meanings using the AQIGuide component with introductory text.",
  "frontend/src/components/sections/AQIForecastSection.tsx": "Interactive section with state/district selectors to display current AQI data and forecasts for Indian locations. Includes color-coded AQI categories and detailed forecast information.",
  "frontend/src/components/sections/DiseasesConditionsSection.tsx": "Section displaying health conditions affected by air pollution using ConditionCard components. Includes medical disclaimer alert.",
  "frontend/src/components/sections/HeroSection.tsx": "Landing hero section with headline, description, call-to-action buttons, and hero image. Includes smooth scroll navigation to other sections.",
  "frontend/src/components/sections/IndoorAirActionPlanSection.tsx": "Comprehensive section providing actionable guidance on improving indoor air quality, covering ventilation, filtration, cooking safety, wildfire precautions, monitoring, and daily maintenance with quick-win tips.",
  "frontend/src/components/sections/LongTermHealthSection.tsx": "Displays educational content about long-term health impacts of air pollution (respiratory, cardiovascular, neurological, life expectancy) with protective strategies and a medical disclaimer. Uses cards and alerts to present health effects and prevention tips.",
  "frontend/src/components/sections/PreventionTipsSection.tsx": "Presents practical tips for reducing air pollution exposure across six categories (indoor air quality, outdoor precautions, masks/filters, physical activity, monitoring, and community action) using icon-labeled cards.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Showcases pollution reduction projects (bike and car silencers) with filterable categories, displaying project cards with images, descriptions, and environmental impact metrics.",
  "frontend/src/components/sections/RequestChangeSection.tsx": "Provides a form for authenticated users to submit change requests with optional section selection and contact info, integrating Internet Identity authentication and displaying success/error states.",
  "frontend/src/components/sections/ReviewBoxSection.tsx": "Displays a simple user reviews section with a 5-star rating component in a centered card layout.",
  "frontend/src/components/sections/SymptomsHelpSection.tsx": "Educates users on recognizing air pollution symptoms (emergency vs. mild/moderate) and when to seek medical help, featuring emergency warning alerts and symptom cards.",
  "frontend/src/components/sections/VideosSection.tsx": "Displays embedded YouTube videos about air pollution and health effects in Hindi and English, organized by language with deduplication logic and fallback UI for unavailable videos.",
  "frontend/src/components/sections/VulnerableGroupsSection.tsx": "Presents information about vulnerable populations (children, older adults, people with health conditions, outdoor workers) and provides protective guidance for each group during poor air quality.",
  "frontend/src/components/sections/WhatIsAQISection.tsx": "Explains the Air Quality Index (AQI), what it measures, why it matters, common pollution sources, and how to interpret the 0-500 scale.",
  "frontend/src/content/aqiCategories.ts": "Defines six AQI categories (Good to Hazardous) with ranges, colors, descriptions, health risks, and recommended actions for each level.",
  "frontend/src/content/conditions.ts": "Contains detailed health condition data (asthma, COPD, cardiovascular disease, etc.) including pollution links, symptoms, and protective steps for each condition.",
  "frontend/src/content/indiaStatesDistricts.ts": "Provides a comprehensive dataset of all Indian states and union territories with their respective districts for location selection functionality.",
  "frontend/src/content/stateAqiForecast.ts": "Defines TypeScript interfaces and static data for state-level AQI (Air Quality Index) information including current readings, categories, forecasts, and last updated timestamps. Includes helper functions to compute AQI categories and generate fallback data for states not in the curated dataset.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Exports InternetIdentityProvider component and useInternetIdentity hook for accessing authentication state and methods.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for React Query hooks related to backend methods. Currently empty as all content is static and client-side only.",
  "frontend/src/hooks/useRobotVerification.ts": "React hook that manages robot verification state using sessionStorage, providing verification status and a method to mark the user as verified.",
  "frontend/src/hooks/useSubmitChangeRequest.ts": "React Query mutation hook for submitting change requests to the backend actor, with automatic query invalidation on success.",
  "frontend/src/hooks/useTheme.ts": "React hook that manages light/dark theme state with localStorage persistence and system preference detection, applying theme classes to the document root using useLayoutEffect.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a forest green and warm amber color palette for both light and dark themes, plus base typography styles.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including color schemes using OKLCH format, container settings, font families (Inter), border radius variables, and custom box shadows. Includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata tracking a feature request to add a 'made by Saharsh UNIYAL' text label in the bottom left corner of the page. Contains one existing feature and one pending feature request (AR-1) with the same objective."
}