{
  "backend/main.mo": "Implements a change‑request system with access‑controlled submission, admin review, and storage in a Nat‑keyed map.",
  "feature_evidence.json": "Defines feature evidence metadata listing footer‑related modifications, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for numerous frontend files describing layout, sections, hooks, and styling.",
  "frontend/index.css": "Defines global Tailwind layers and extensive OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point that loads the React app with metadata for the AirHealth site.",
  "frontend/src/App.tsx": "Main React component composing header, footer, credit label, and all content sections including projects and change requests.",
  "frontend/src/components/aqi/AQIGuide.tsx": "Interactive tabbed AQI guide showing category info, risks, and actions with educational alerts.",
  "frontend/src/components/diseases/ConditionCard.tsx": "Reusable card rendering a health condition’s icon, description, symptoms, and protective steps.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer with branding, smooth‑scroll quick links, medical notice, and copyright year without the Caffeine AI attribution.",
  "frontend/src/components/layout/SiteHeader.tsx": "Responsive site header with desktop and mobile navigation that scrolls to sections smoothly.",
  "frontend/src/components/layout/TopRightCreditLabel.tsx": "Displays a fixed bottom-left credit label with the creator's name.",
  "frontend/src/components/sections/AQICategoriesSection.tsx": "Section introducing AQI categories and displaying the AQIGuide component.",
  "frontend/src/components/sections/DiseasesConditionsSection.tsx": "Explains health impacts of air pollution, shows a disclaimer, and lists condition cards.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with introductory text, CTA buttons, and a large image that scrolls to key sections.",
  "frontend/src/components/sections/PreventionTipsSection.tsx": "Provides prevention and protection tips in card format covering indoor, outdoor, and mask-related guidance.",
  "frontend/src/components/sections/ProjectsSection.tsx": "Shows filterable project cards for bike and car pollution‑reduction technologies.",
  "frontend/src/components/sections/RequestChangeSection.tsx": "Authenticated form allowing users to submit change requests with optional metadata.",
  "frontend/src/components/sections/SymptomsHelpSection.tsx": "Outlines emergency symptoms, mild symptoms, and guidance on when to seek medical help.",
  "frontend/src/components/sections/VulnerableGroupsSection.tsx": "Renders a section describing vulnerable groups affected by air pollution with cards for each group and protective guidance.",
  "frontend/src/components/sections/WhatIsAQISection.tsx": "Displays an overview of the Air Quality Index, including what it measures, why it matters, pollution sources, and scale details.",
  "frontend/src/content/aqiCategories.ts": "Defines AQI category data with ranges, colors, descriptions, health risks, and recommended actions.",
  "frontend/src/content/conditions.ts": "Provides structured health condition data linking diseases to pollution impacts, symptoms, and protective steps.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, handling login, stored identities, status tracking, and auth client creation.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future query hooks; currently empty as backend has no methods.",
  "frontend/src/hooks/useSubmitChangeRequest.ts": "Defines a mutation for submitting change requests through the backend actor and invalidates related queries on success.",
  "frontend/src/index.css": "Defines Tailwind layers plus extensive OKLCH CSS variables for light/dark themes and applies base typography and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and an Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom theme colors mapped to CSS variables, extended typography, containers, and plugins.",
  "project_state.json": "Tracks project state, indicating the active request to remove the Caffeine AI attribution watermark and related cleanup."
}