{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "User-facing light/dark theme toggle with persistence and full UI audit",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Provide a header Light/Dark theme toggle that updates the full UI instantly and remains accessible on desktop and mobile.",
      "acceptanceCriteria": [
        "A theme toggle control is visible in the header on both desktop and mobile layouts.",
        "Clicking the toggle switches between light and dark modes without requiring a page reload.",
        "The toggle has an accessible label indicating the action (e.g., “Switch to dark mode” / “Switch to light mode”)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/SiteHeader.tsx",
          "operation": "modify",
          "description": "Confirm the ThemeToggle is rendered in both the desktop nav and the mobile header controls and that it remains discoverable in responsive layouts; ensure the header container styling uses theme tokens (e.g., bg-background/text-foreground) so it correctly follows the active theme. Verify the component's usage instructions before implementing. (shadcn-ui: continue using its Button/Sheet primitives for consistent theming and accessibility.)"
        },
        {
          "path": "frontend/src/components/layout/ThemeToggle.tsx",
          "operation": "modify",
          "description": "Ensure the toggle control exposes an action-oriented accessible name that changes with state (keep aria-label aligned to the next action) and that the icon swap remains readable in both themes; keep using shadcn-ui Button for focus/keyboard behavior consistency. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Persist the chosen theme in localStorage, default to system preference when unset, and apply the theme before first paint to avoid flashing.",
      "acceptanceCriteria": [
        "After selecting dark mode, refreshing the page keeps the site in dark mode.",
        "After selecting light mode, refreshing the page keeps the site in light mode.",
        "When no theme has been previously selected, the initial theme defaults to the user’s system preference (prefers-color-scheme).",
        "No visible “flash” from light to dark (or dark to light) occurs during initial page load."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Harden the existing pre-React theme bootstrap so it deterministically applies/removes the 'dark' class based on localStorage('theme') and (when absent) prefers-color-scheme; ensure it runs as early as possible and matches the same storage key/value contract used by the React theme hook to prevent mismatches. (No third-party theming libs.)"
        },
        {
          "path": "frontend/src/hooks/useTheme.ts",
          "operation": "modify",
          "description": "Update theme state management to (1) safely read localStorage and system preference, (2) apply the 'dark' class with the least delay (prefer useLayoutEffect for DOM class changes to reduce flicker), and (3) keep localStorage in sync whenever the user toggles; validate stored values and fall back to system preference when unset/invalid."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Audit and update major UI surfaces to ensure consistent, readable styling in both themes using theme tokens instead of hard-coded colors.",
      "acceptanceCriteria": [
        "Primary layouts (header, footer, main sections, cards) display appropriate background, border, and text contrast in both themes.",
        "Gradients and muted surfaces remain visually coherent in dark mode (no washed-out or illegible areas).",
        "Embedded content containers (e.g., video cards) remain visually consistent with the surrounding theme (card/muted styling looks correct in dark mode)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/sections/HeroSection.tsx",
          "operation": "modify",
          "description": "Adjust hero gradient/surface classes to ensure the gradient remains coherent in dark mode (avoid overly faint 'from-* / to-*' combinations); rely on theme tokens (background/muted/primary) rather than hard-coded colors so the section stays readable in both themes."
        },
        {
          "path": "frontend/src/components/sections/VideosSection.tsx",
          "operation": "modify",
          "description": "Ensure video cards and the 'video unavailable' fallback use token-based surfaces (card/muted/background) and borders so embedded containers maintain contrast and look consistent in dark mode; avoid hard-coded color fills."
        },
        {
          "path": "frontend/src/components/sections/ProjectsSection.tsx",
          "operation": "modify",
          "description": "Update project cards (category pill, impact callout, image placeholder surface) to rely on theme tokens (card/muted/accent/border/foreground) and ensure contrast is acceptable in dark mode; avoid washed-out accent overlays by tuning token-based alpha usage."
        },
        {
          "path": "frontend/src/components/sections/AQIForecastSection.tsx",
          "operation": "modify",
          "description": "Audit dialogs, scroll areas, and inline 'bg-muted/*' surfaces for dark-mode legibility; ensure informational/warning alerts remain readable in both themes using token-based backgrounds/foregrounds (and dark: variants where needed) without introducing hard-coded palette colors."
        },
        {
          "path": "frontend/src/components/sections/SymptomsHelpSection.tsx",
          "operation": "modify",
          "description": "Review alert and card styling so destructive/warning surfaces remain readable in dark mode; prefer token-based classes (destructive/warning/muted/foreground) and avoid any fixed light-only background assumptions."
        },
        {
          "path": "frontend/src/components/aqi/AQIGuide.tsx",
          "operation": "modify",
          "description": "Reduce reliance on hard-coded inline color usage where possible (e.g., ensure tabs/cards use bg-card/text-foreground/muted tokens); where category colors must remain (AQI category swatches/badges), ensure surrounding surfaces and text remain token-driven and accessible in both themes."
        },
        {
          "path": "frontend/src/components/layout/SiteFooter.tsx",
          "operation": "modify",
          "description": "Ensure footer background/border/text uses theme tokens and that muted link styling remains readable in dark mode (hover/focus states included) without hard-coded colors."
        },
        {
          "path": "frontend/src/components/layout/TopRightCreditLabel.tsx",
          "operation": "modify",
          "description": "Tune the credit label's backdrop and text styling to maintain contrast across both themes using token-based background/foreground classes; ensure backdrop blur + alpha remains legible on dark surfaces."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "If any contrast issues are found during the audit, adjust the existing CSS variable tokens for light/dark (e.g., --muted, --muted-foreground, --border) to improve readability while keeping the design system consistent; do not introduce a new theming library."
        }
      ]
    }
  ]
}